tap "buo/cask-upgrade"
tap "garden-io/garden"
tap "homebrew/bundle"
tap "homebrew/services"
tap "zen-browser/browser", "https://github.com/zen-browser/desktop.git"

brew "node"
brew "dust"
brew "esbuild"
brew "fzf"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "go"
brew "rust"
brew "lsd"
brew "duti"
brew "mas"
brew "fileicon"
brew "mkcert"
brew "starship"
brew "watchman"
brew "yarn"
brew "yazi"
brew "zrok"
brew "navi"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "garden-io/garden/garden-cli"
cask "1password"
cask "font-hack-nerd-font"
cask "obsidian"
cask "raycast"
cask "telegram"
cask "wezterm"
cask "whatroute"
cask "zen-browser"
cask "qbittorrent"
cask "hex-fiend"
cask "docker"
cask "numi"
cask "sublime-text"
mas "1Password for Safari", id: 1569813296
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
